Revit 2026 API

# ViewCropRegionShapeManagerGetAnnotationCropShape Method

---

Gets the annotation crop box assigned to the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveLoop GetAnnotationCropShape()
```
```vb
Public Function GetAnnotationCropShape As CurveLoop
```
```cpp
public:
CurveLoop^ GetAnnotationCropShape()
```
```fsharp
member GetAnnotationCropShape : unit -> CurveLoop
```

#### Return Value

CurveLoop The annotation crop boundary.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | View is not allowed to have an annotation crop. |

Currently, this method returns only the rectangular annotation crop box.

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace